perf/stressTesting/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/metar'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    path: "../airport_codes.csv"
    fields:
      - "code"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 60
      arrivalRate: 1
      rampTo: 5
    - name: Plain load
      duration: 60
      arrivalRate: 40
      rampTo: 100
    - name: Plain load 2
      duration: 60
      arrivalRate: 100
      rampTo: 300
    - name: Plain load 3 ##Aca ya empieza a tirar errores
      duration: 60
      arrivalRate: 300
      rampTo: 500
    - name: Plain load 4 
      duration: 60
      arrivalRate: 500
      #rampTo: 5
    - name: Cool Down
      duration: 30
      arrivalRate: 1

scenarios:
  - name: StressMetar (/)
    flow:
      - get:
          url: '/?station={{ code }}'