perf/stressTesting/metar.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555/api/metar'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
  payload:
    path: "../airport_codes.csv"
    fields:
      - "code"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm Up
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain load
      duration: 60
      arrivalRate: 5
      rampTo: 50
    - name: Plain load 2
      duration: 60
      arrivalRate: 50
      rampTo: 75
    - name: Plain load 3
      duration: 60
      arrivalRate: 75
      rampTo: 200
    - name: Cool Down
      duration: 30
      arrivalRate: 50
      rampTo: 1

scenarios:
  - name: StressMetar (/)
    flow:
      - get:
          url: '/?station={{ code }}'